server/app/controllers/drinks_controller.rb

SELECT id, title FROM "drinks"
---
  def index
    @drinks = Drink.select("id, title").all

SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @drink = Drink.find(params[:id])

SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_drink
      @drink = Drink.find(params[:id])